eldarkg/emdr1986x-std-per-lib/MDR32F8_StdPeriph_Driver/inc/mdr32f8_can.h
/** @defgroup CAN_interrupts CAN Interrupts
  * @{
  */

#define CAN_IT_GLBINTEN            (((uint32_t)0x1) <<  0) /*!< General flag that enables CAN module interrupts */
#define CAN_IT_RXINTEN             (((uint32_t)0x1) <<  1) /*!< Flag that enables interrupt on message reception */
#define CAN_IT_TXINTEN             (((uint32_t)0x1) <<  2) /*!< Flag that enables interrupt if transmission becomes available */
#define CAN_IT_ERRINTEN            (((uint32_t)0x1) <<  3) /*!< Flag that enables interrupt on error */
#define CAN_IT_ERROVERINTEN        (((uint32_t)0x1) <<  4) /*!< Flag that enables interrupt on TEC or REC exceeds ERROR_MAX value */

#define CAN_IT_MASK		(CAN_IT_GLBINTEN | CAN_IT_RXINTEN | CAN_IT_TXINTEN |\
						 CAN_IT_ERRINTEN | CAN_IT_ERROVERINTEN)

#define IS_CAN_ITConfig(IT) 		((IT & (~CAN_IT_MASK)) == 0)

/** @} */ /* End of group CAN_interrupts */

/** @defgroup CAN_Buffer_Interrupts CAN Buffer Interrupts
  * @{
  */

#define CAN_BUFFER_0               (((uint32_t)0x1) <<  0)
#define CAN_BUFFER_1               (((uint32_t)0x1) <<  1)
#define CAN_BUFFER_2               (((uint32_t)0x1) <<  2)
#define CAN_BUFFER_3               (((uint32_t)0x1) <<  3)
#define CAN_BUFFER_4               (((uint32_t)0x1) <<  4)
#define CAN_BUFFER_5               (((uint32_t)0x1) <<  5)
#define CAN_BUFFER_6               (((uint32_t)0x1) <<  6)
#define CAN_BUFFER_7               (((uint32_t)0x1) <<  7)
#define CAN_BUFFER_8               (((uint32_t)0x1) <<  8)
#define CAN_BUFFER_9               (((uint32_t)0x1) <<  9)
#define CAN_BUFFER_10              (((uint32_t)0x1) << 10)
#define CAN_BUFFER_11              (((uint32_t)0x1) << 11)
#define CAN_BUFFER_12              (((uint32_t)0x1) << 12)
#define CAN_BUFFER_13              (((uint32_t)0x1) << 13)
#define CAN_BUFFER_14              (((uint32_t)0x1) << 14)
#define CAN_BUFFER_15              (((uint32_t)0x1) << 15)
#define CAN_BUFFER_16              (((uint32_t)0x1) << 16)
#define CAN_BUFFER_17              (((uint32_t)0x1) << 17)
#define CAN_BUFFER_18              (((uint32_t)0x1) << 18)
#define CAN_BUFFER_19              (((uint32_t)0x1) << 19)
#define CAN_BUFFER_20              (((uint32_t)0x1) << 20)
#define CAN_BUFFER_21              (((uint32_t)0x1) << 21)
#define CAN_BUFFER_22              (((uint32_t)0x1) << 22)
#define CAN_BUFFER_23              (((uint32_t)0x1) << 23)
#define CAN_BUFFER_24              (((uint32_t)0x1) << 24)
#define CAN_BUFFER_25              (((uint32_t)0x1) << 25)
#define CAN_BUFFER_26              (((uint32_t)0x1) << 26)
#define CAN_BUFFER_27              (((uint32_t)0x1) << 27)
#define CAN_BUFFER_28              (((uint32_t)0x1) << 28)
#define CAN_BUFFER_29              (((uint32_t)0x1) << 29)
#define CAN_BUFFER_30              (((uint32_t)0x1) << 30)
#define CAN_BUFFER_31              (((uint32_t)0x1) << 31)

/** @} */ /* End of group CAN_Buffer_Interrupts */

/** @defgroup CAN_Clock_BRG
  * @{
  */

#define CAN_HCLKdiv1                        ((uint32_t)0x00000000)
#define CAN_HCLKdiv2                        ((uint32_t)0x00000001)
#define CAN_HCLKdiv4                        ((uint32_t)0x00000002)
#define CAN_HCLKdiv8                        ((uint32_t)0x00000003)
#define CAN_HCLKdiv16                       ((uint32_t)0x00000004)
#define CAN_HCLKdiv32                       ((uint32_t)0x00000005)
#define CAN_HCLKdiv64                       ((uint32_t)0x00000006)
#define CAN_HCLKdiv128                      ((uint32_t)0x00000007)

#define IS_CAN_CLOCK_BRG(BRG)               ((BRG) <= 7)

#define CAN_DIV_Msk        								 ((uint32_t)0x0000FFFF)
#define CAN_CLK_EN         								 (1<<16)
#define CAN_CLKSRC_msk                     ((uint32_t)0xF0000000) 
#define CAN_CLKSRC_offs                    28

#define CAN_CLKSRC_HSI                     ((uint32_t)0x00000000)
#define CAN_CLKSRC_HSE0                    ((uint32_t)0x00000001)
#define CAN_CLKSRC_HSE1                    ((uint32_t)0x00000002)
#define CAN_CLKSRC_LSI                     ((uint32_t)0x00000003)
#define CAN_CLKSRC_LSE                     ((uint32_t)0x00000004)
#define CAN_CLKSRC_PLL0                    ((uint32_t)0x00000005)
#define CAN_CLKSRC_PLL1                    ((uint32_t)0x00000006)
#define CAN_CLKSRC_PLL2                    ((uint32_t)0x00000007)
#define CAN_CLKSRC_MAX_CLK                 ((uint32_t)0x0000000C)

#define IS_CAN_CLKSRC(CLKSRC)  					(((CLKSRC) == CAN_CLKSRC_HSI)  || \
																					 ((CLKSRC) == CAN_CLKSRC_HSE0) || \
																					 ((CLKSRC) == CAN_CLKSRC_HSE1) || \
																					 ((CLKSRC) == CAN_CLKSRC_LSI)  || \
																					 ((CLKSRC) == CAN_CLKSRC_LSE)  || \
																					 ((CLKSRC) == CAN_CLKSRC_PLL0) || \
																					 ((CLKSRC) == CAN_CLKSRC_PLL1) || \
																					 ((CLKSRC) == CAN_CLKSRC_PLL2) || \
																					 ((CLKSRC) == CAN_CLKSRC_MAX_CLK))																				 

#define CAN_CLKdiv1                        ((uint32_t)0x00000000)
#define CAN_CLKdiv2                        ((uint32_t)0x00000001)
#define CAN_CLKdiv4                        ((uint32_t)0x00000002)
#define CAN_CLKdiv8                        ((uint32_t)0x00000003)

/** @} */ /* End of group CAN_Clock_BRG */

/** @} */ /* End of group CAN_Exported_Constants */

/** @defgroup CAN_Exported_Macros CAN Exported Macros
  * @{
  */

/** @defgroup CAN_ID_conversion CAN Standard to/from Extended ID conversion
  * @{
  */

#define CAN_STDID_TO_EXTID(STDID)  ((STDID) << CAN_ID_SID_Pos)
#define CAN_EXTID_TO_STDID(EXTID)  ((EXTID) >> CAN_ID_SID_Pos)

/** @} */ /* End of group CAN_ID_conversion */



/** @} */ /* End of group CAN_Exported_Macros */

/** @defgroup CAN_Exported_Functions CAN Exported Functions
  * @{
  */

void CAN_DeInit(MDR_CAN_TypeDef* CANx);
void CAN_Init(MDR_CAN_TypeDef* CANx, const CAN_InitTypeDef* CAN_InitStruct);
void CAN_StructInit(CAN_InitTypeDef* CAN_InitStruct);
void CAN_FilterInit(MDR_CAN_TypeDef* CANx, uint32_t BufferNumber, CAN_FilterInitTypeDef* CAN_FilterInitStruct);
void CAN_ITConfig(MDR_CAN_TypeDef* CANx, uint32_t CAN_IT, FunctionalState NewState);
uint32_t CAN_GetDisabledBuffer(MDR_CAN_TypeDef* CANx);
uint32_t CAN_GetEmptyTransferBuffer(MDR_CAN_TypeDef* CANx);
void CAN_Transmit(MDR_CAN_TypeDef* CANx, uint32_t BufferNumber, CAN_TxMsgTypeDef* TxMessage);
void CAN_SendRTR(MDR_CAN_TypeDef* CANx, uint32_t BufferNumber, CAN_RTRMessageTypeDef* RTRMessage);
void CAN_RTRReply(MDR_CAN_TypeDef* CANx, uint32_t BufferNumber, CAN_RTRReplyTypeDef* RTRReplyMessage);
void CAN_Receive(MDR_CAN_TypeDef* CANx, uint32_t BufferNumber, FunctionalState OverWrite);
void CAN_GetReceivedData(MDR_CAN_TypeDef* CANx, uint32_t BufferNumber, CAN_DataTypeDef RxBuffer);
void CAN_GetRawReceivedData(MDR_CAN_TypeDef* CANx, uint32_t BufferNumber, CAN_RxMsgTypeDef* RxMessage);
void CAN_BufferRelease(MDR_CAN_TypeDef* CANx, uint32_t BufferNumber);
void CAN_Cmd(MDR_CAN_TypeDef* CANx, FunctionalState NewState);
uint32_t CAN_GetStatus(MDR_CAN_TypeDef* CANx);
uint32_t CAN_GetBufferStatus(MDR_CAN_TypeDef* CANx, uint32_t BufferNumber);
ITStatus CAN_GetITState(MDR_CAN_TypeDef* CANx, uint32_t CAN_IT);
void CAN_ITClearErrorPendingBit(MDR_CAN_TypeDef* CANx, uint32_t Status_Flag);
void CAN_RxITConfig(MDR_CAN_TypeDef* CANx, uint32_t Buffer_IT, FunctionalState NewState);
ITStatus CAN_GetRxITStatus(MDR_CAN_TypeDef* CANx, uint32_t BufferNumber);
uint32_t CAN_GetRx(MDR_CAN_TypeDef* CANx);
void CAN_TxITConfig(MDR_CAN_TypeDef* CANx, uint32_t Buffer_IT, FunctionalState NewState);
ITStatus CAN_GetTxITStatus(MDR_CAN_TypeDef* CANx, uint32_t BufferNumber);
void CAN_ITClearRxTxPendingBit(MDR_CAN_TypeDef* CANx, uint32_t BufferNumber, uint32_t Status_Flag);

void CAN_CLK_en(uint32_t CAN_CLK_DIV);


/** @} */ /* End of group CAN_Exported_Functions */

/** @} */ /* End of group CAN */

/** @} */ /* End of group MDR32F8_StdPeriph_Driver */

#ifdef __cplusplus
} // extern "C" block end
#endif

#endif /* __MDR32F8_CAN_H */

/******************* (C) COPYRIGHT 2015 Milandr *********
*
* END OF FILE mdr32f8_can.h */

